# -*- coding: utf-8 -*-
CURRICULUM = {                       # מקצוע -> {ז, ח, ט}
 "שפה":            {"ז":3,"ח":3,"ט":3},
 "מתמטיקה":        {"ז":5,"ח":5,"ט":5},
 "חינוך":          {"ז":3,"ח":3,"ט":2},   # ט הורד ל-2 לבקשתך
 "חינוך פיננסי":   {"ז":0,"ח":0,"ט":0},
 "מדעים":          {"ז":4,"ח":4,"ט":4},
 'תנ"ך':           {"ז":2,"ח":2,"ט":2},
 "חינוך גופני":    {"ז":2,"ח":2,"ט":2},
 "אזרחות":         {"ז":0,"ח":0,"ט":2},
 "ערבית":          {"ז":3,"ח":3,"ט":3},
 "מגמות":          {"ז":4,"ח":4,"ט":4},
 "אנגלית":         {"ז":4,"ח":4,"ט":5},
 "רב מלל":         {"ז":4,"ח":4,"ט":4},
}
DAY_HOURS_HAT = [5,7,6,7,7,4]        # א עד 5, ב עד 7, ג עד 6, ד עד 7, ה עד 7, ו עד 4
